{
  "outlines": [
    {
      "title": "Riley's Presentation",
      "context": {
        "text": "Intro",
        "innerContext": "Hello! I'm Riley Soloner, I'm a software engineer.",
        "innerCatalyst": "I made this web application Story Outliner.",
        "innerPoint": "My goal was to create an app that streamlines the early stages of the story writing process.",
        "innerClimax": "Allowing users to more effectively plan and write stories.",
        "innerDenouement": "I built this Front-End app using React with a JSON database. For styling, I used custom CSS and ReactSuite components."
      },
      "catalyst": {
        "text": "This is Story Outliner",
        "innerContext": "The homepage is a simple form with three buttons at the top.",
        "innerCatalyst": "If breaking a story is new to you, click the About button to open the drawer.",
        "innerPoint": "Here I've included a graphic representation of how a simple narrative arc is built.",
        "innerClimax": "The major points of a story are like smaller stories within the main one.",
        "innerDenouement": "Press escape or click the X in the header to return to the main page."
      },
      "point": {
        "text": "Entering Input",
        "innerContext": "Enter your input to begin outlining your story.",
        "innerCatalyst": "If you're not familiar with these terms, you can hover over them to see multiple definitions.",
        "innerPoint": "Clicking the small arrows at the bottom of each input field reveals a nested list inside the main points (ask somebody about a movie they know well).",
        "innerClimax": "Now that we have some of our story outlined, let's click visualize.",
        "innerDenouement": "In this drawer, you'll see your story laid out, with the different sections laid out in their place in the larger story. Any area that isn’t yet filled in will display its placeholder title, so it’s easy to know what’s left to fill in."
      },
      "climax": {
        "text": "Submitting an Outline",
        "innerContext": "OK. We have our outline in pretty good shape. We're ready to save it.",
        "innerCatalyst": "Scroll down to the bottom of the page and click \"submit to database\"\"",
        "innerPoint": "Now you're ready to see your work in the gallery page.",
        "innerClimax": "Here's a list of every outline submitted to the database, with the most recently submitted outline at the top.",
        "innerDenouement": "Every outline in the database can be viewed in list mode or in visualize mode. Here's our newly submitted Outline, here's Back to the Future, and here's Star Wars."
      },
      "denouement": {
        "text": "Ending",
        "innerContext": "Oh, would you look at that:",
        "innerCatalyst": "It seems that this presentation I'm currently giving was also written using Story Outliner.",
        "innerPoint": "Well that's kind of clever.",
        "innerClimax": "Anyway, I hope you enjoyed my demo",
        "innerDenouement": "Thanks!"
      },
      "id": 0
    },
    {
      "title": "Star Wars (1977)",
      "context": {
        "text": "In a Galaxy Far, Far Away",
        "innerContext": "An Imperial Star Destroyer captures a Rebel Cruiser.",
        "innerCatalyst": "Darth Vader boards the Cruiser.",
        "innerPoint": "Princess Leia loads secret data into R2D2.",
        "innerClimax": "Leia captured, R2D2 & C-3PO blast off in an escape pod.",
        "innerDenouement": "R2 & 3PO's escape pod careens toward Tatooine."
      },
      "catalyst": {
        "text": "A Purchase Leads to Adventure",
        "innerContext": "Droids captured by Jawas, sold to Uncle Owen and Luke.",
        "innerCatalyst": "While cleaning R2, Luke sees Leia's plea for help.",
        "innerPoint": "\"Ben\" Kenobi rescues Luke and tells him of the Jedi Knights.",
        "innerClimax": "Luke receives his father's lightsaber.",
        "innerDenouement": "Luke refuses Obi Wan's offer to accompany him to Alderaan."
      },
      "point": {
        "text": "Belly of the Beast",
        "innerContext": "Luke discovers his home and family destroyed.",
        "innerCatalyst": "Luke & Obi-Wan meet Han & Chewbacca. They escape towards Alderaan.",
        "innerPoint": "The Death Star destroys Alderaan, captures the Millennium Falcon.",
        "innerClimax": "Luke, Han and Chewbacca rescue Leia. Obi-Wan sacrifices himself.",
        "innerDenouement": "The group escapes to a rebel base on Yavin IV."
      },
      "climax": {
        "text": "Dogfight",
        "innerContext": "The Rebels discuss the Death Star's hidden weakness.",
        "innerCatalyst": "Luke joins the rogue squadron in an X-Wing starfighter.",
        "innerPoint": "The Rebels suffer heavy losses. Only Luke is left to take the final shot.",
        "innerClimax": "Obi Wan: \"use the Force, Luke!\" Luke destroys the Death Star. Kaboom!",
        "innerDenouement": "Luke and Han fly back to Yavin IV."
      },
      "denouement": {
        "text": "Triumphant Ceremony",
        "innerContext": "Back on Yavin IV, the trumpets blare.",
        "innerCatalyst": "Luke, Han and Chewbacca enter the throne room.",
        "innerPoint": "Leia awards Luke and Han medals of honor.",
        "innerClimax": "Our heroes turn and accept the applause of the rebels.",
        "innerDenouement": "Chewie, questioningly: \"Where's MY medal?\""
      },
      "id": 1
    },
    {
      "title": "Back to the Future (1985)",
      "context": {
        "text": "Hill Valley, CA. 1985",
        "innerContext": "Marty McFly enters Doc Brown's garage.",
        "innerCatalyst": "Late for school, Marty skates through town.",
        "innerPoint": "Principal Strickland catches and admonishes Marty.",
        "innerClimax": "Marty band auditions for Battle of the Bands",
        "innerDenouement": "Down on his luck, Marty confides in Jennifer: He fears becoming like his parents."
      },
      "catalyst": {
        "text": "Twin Pines Mall",
        "innerContext": "Late at night, Doc Brown unveils his time machine DeLorean.",
        "innerCatalyst": "Gunmen arrive and begin shooting at Doc and Marty.",
        "innerPoint": "Doc Brown is gunned down. Marty jumps into the DeLorean",
        "innerClimax": "Marty hits 88 MPH and travels back to 1955. He crashes into a barn.",
        "innerDenouement": "Marty looks at the \"Hill Valley 2 Miles\" sign as he walks into town."
      },
      "point": {
        "text": "Hill Valley, CA. 1955",
        "innerContext": "Marty wanders around 1955 Hill Valley.",
        "innerCatalyst": "Marty saves George from getting run over & becomes the object of Lorraine's affection.",
        "innerPoint": "Brown theorizes: the only available energy source powerful enough to send Marty back to 1985 is lightning.",
        "innerClimax": "Marty's siblings fade from a photograph. His actions have altered the future.",
        "innerDenouement": "Marty attempts to get his future parents acquainted, but fails."
      },
      "climax": {
        "text": "Enchantment Under the Sea",
        "innerContext": "Lorraine asks Marty to the school dance.",
        "innerCatalyst": "Marty's plan for George to rescue Lorraine is foiled by Biff. George punches Biff.",
        "innerPoint": "Biff's goons trap Marty in a car trunk.",
        "innerClimax": "Rescued by the band, Marty joins them on guitar. Lorraine and George kiss.",
        "innerDenouement": "With his future no longer in jeopardy, Marty heads to the courthouse."
      },
      "denouement": {
        "text": "We Don't Need Roads",
        "innerContext": "Doc and Marty attempt to catch lightning to send Marty Back to the Future",
        "innerCatalyst": "Doc find's Marty's letter and destroys it. Marty plans to go back earlier to save Doc.",
        "innerPoint": "Marty returns to 1985. The DeLorean malfunctions. He sees Doc gunned down again.",
        "innerClimax": "Marty discovers Brown is alive. He read the letter after all.",
        "innerDenouement": "Back home, Marty's family life is different and better. Doc Brown has a new flying time machine."
      },
      "id": 2
    },
    {
      "title": "THE GREAT ADVENTURE",
      "context": {
        "text": "Movie Starts",
        "innerContext": "123",
        "innerCatalyst": "4567",
        "innerPoint": "data",
        "innerClimax": "lkjlkjlk",
        "innerDenouement": "doot"
      },
      "catalyst": {
        "text": "things accelerate",
        "innerContext": "you hear me",
        "innerCatalyst": "4567",
        "innerPoint": "boon",
        "innerClimax": "",
        "innerDenouement": ""
      },
      "point": {
        "text": "something else happens",
        "innerContext": "",
        "innerCatalyst": "",
        "innerPoint": "",
        "innerClimax": "",
        "innerDenouement": ""
      },
      "climax": {
        "text": "wow this happened",
        "innerContext": "",
        "innerCatalyst": "",
        "innerPoint": "",
        "innerClimax": "",
        "innerDenouement": ""
      },
      "denouement": {
        "text": "hoy hoy",
        "innerContext": "",
        "innerCatalyst": "",
        "innerPoint": "",
        "innerClimax": "",
        "innerDenouement": ""
      },
      "id": 3
    }
  ]
}